PureEngineering/PUREmodules/nrf52/modules_examples/grid_eye_ble/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 *//*
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}*/



/**
 * @brief Initialize the master TWI
 *
 * Function used to initialize master TWI interface that would communicate with simulated EEPROM.
 *
 * @return NRF_SUCCESS or the reason of failure
 */
static ret_code_t twi_master_init(void)
{
    ret_code_t ret;
    const nrf_drv_twi_config_t config =
    {
       .scl                = TWI_SCL_M,
       .sda                = TWI_SDA_M,
       .frequency          = NRF_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    ret = nrf_drv_twi_init(&m_twi_master, &config, NULL, NULL);

    if (NRF_SUCCESS == ret)
    {
        nrf_drv_twi_enable(&m_twi_master);
    }

    return ret;
}

uint16_t read_grideye_2bytes(nrf_drv_twi_t twi_master,uint8_t addr, uint8_t subAddress){
	ret_code_t ret;
	uint16_t full_data;
	uint8_t buffer[2];
	buffer[0] = subAddress;

	ret = nrf_drv_twi_tx(&twi_master, addr, buffer, 1, false);
	if (NRF_SUCCESS != ret){
		NRF_LOG_WARNING("Communication error when asking to read\r\n");
		return (uint8_t)ret;
	}
	ret = nrf_drv_twi_rx(&twi_master, addr, buffer, 2);
	if (NRF_SUCCESS != ret){
		NRF_LOG_WARNING("Communication error when reading first byte\r\n");
		return (uint8_t)ret;
	}
	full_data = (buffer[1]<<8) | buffer[0];
	return full_data;

}


//changing slightly from the arduino example to compress the amount of data being send over the ble, leaving data in hex and not converting to floating point, capping data to 0-255 range, 0xff
//
//will do this adjusting in the app. 
//anything bigger than 2047 is negative
//if(temperature > 2047) {
//	temperature = temperature - 4096;
//}

//celsius = temperature * 0.25;
//NRF_LOG_RAW_INFO("%x", temperature);
//
static int grid_eye(void) {
	const uint8_t dummy_data = 0x00; // Declare some dummy data to use for our search for devices on the TWI bus
	uint8_t ble_string[32];
	int ble_string_length;
	int temperature_row[8];

	pixelTempL = 0x80;

	//this is talking to the thermistor register and getting the ambient temperature
	int16_t therm_temp = read_grideye_2bytes(m_twi_master, addr, thermistor_addr); 
	ble_string_length = sprintf(ble_string, "%x\nGE:\n",therm_temp);
	send_ble_data(m_nus,ble_string,ble_string_length);
	NRF_LOG_RAW_INFO("%s", ble_string);
	NRF_LOG_FLUSH(); 

	for (int pixel= 0; pixel <64; pixel++) 
	{
		//grabs 2 bytes of information from the temperature register
		temperature_row[pixel%8] = read_grideye_2bytes(m_twi_master, addr, pixelTempL) ;

		if(temperature_row[pixel%8] > 0xff)
		{
			temperature_row[pixel%8] = 0xff;  //cap max temp to prevent data from exceeding 2 bytes
		}

		if( (pixel+1) %8 == 0) 
		{
			ble_string_length = sprintf(ble_string, "%02x%02x%02x%02x%02x%02x%02x%02x\n",temperature_row[0],temperature_row[1],temperature_row[2],temperature_row[3],temperature_row[4],temperature_row[5],temperature_row[6],temperature_row[7]);
		
			send_ble_data(m_nus,ble_string,ble_string_length);
			NRF_LOG_RAW_INFO("%s", ble_string);
			NRF_LOG_FLUSH(); 
		}

		pixelTempL += 2;

	}//end for

	return 0;
}

APP_TIMER_DEF(sensor_loop_timer_id);

static void sensor_loop_handler(void * p_context)
{
	grid_eye();
}

static void create_sensor_timer()
{   
    uint32_t err_code;

    // Create timers
    err_code = app_timer_create(&sensor_loop_timer_id, APP_TIMER_MODE_REPEATED, sensor_loop_handler);
    APP_ERROR_CHECK(err_code);

     err_code = app_timer_start(sensor_loop_timer_id, APP_TIMER_TICKS(200, APP_TIMER_PRESCALER), NULL);
     APP_ERROR_CHECK(err_code);
}


int main(void)
{
	uint32_t err_code;
	bool erase_bonds;

	/* Initializing TWI master interface for SuperSensor */
	err_code = twi_master_init();
	APP_ERROR_CHECK(err_code);

	APP_ERROR_CHECK(NRF_LOG_INIT(NULL));

	// Initialize.
	APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
	uart_init();

	buttons_leds_init(&erase_bonds);
	ble_stack_init();
	gap_params_init();
	services_init();
	advertising_init();
	conn_params_init();
	bsp_board_leds_init();

	NRF_LOG_RAW_INFO("GRIDEYE Starting\n\r");
	err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
	APP_ERROR_CHECK(err_code);

	NRF_LOG_FLUSH();

	create_sensor_timer();
	// Enter main loop.
	for (;;)
	{
		err_code = sd_app_evt_wait();
		APP_ERROR_CHECK(err_code);
	}
}


/**
 * @}
 */
